# IMPORTING LIBRARIES

In [1]:
#Loading
import pandas as pd
import numpy as np

#Data Visualisation
import seaborn as sns
import matplotlib.pyplot as plt

# TO READ  TRAIN DATASET

In [2]:
df=pd.read_csv('Final_Train_Dataset.csv') 
df.head()

,Unnamed: 0,experience,job_description,job_desig,job_type,key_skills,location,salary,company_name_encoded
0,0,5-7 yrs,Exp: Minimum 5 years;Good understanding of IOC...,Senior Exploit and Vulnerability Researcher,NaN,"team skills, communication skills, analytical ...",Delhi NCR(Vikas Puri),6to10,3687
1,1,10-17 yrs,He should have handled a team of atleast 5-6 d...,Head SCM,NaN,"ppc, logistics, inventory management, supply c...",Sonepat,10to15,458
2,2,5-9 yrs,Must be an effective communicator (written & s...,Deputy Manager - Talent Management & Leadershi...,Analytics,"HR Analytics, Employee Engagement, Training, S...",Delhi NCR,15to25,4195
3,3,7-10 yrs,7 - 10 years of overall experience in data e...,Associate Manager Data Engineering,Analytics,"SQL, Javascript, Automation, Python, Ruby, Ana...",Bengaluru,10to15,313
4,4,1-3 yrs,Chartered Accountancy degree or MBA in Finance...,TS- GSA- Senior Analyst,NaN,"accounting, finance, cash flow, financial plan...",Gurgaon,3to6,1305

In [3]:
df.shape

(19802, 9)

In [4]:
df.columns

Index(['Unnamed: 0', 'experience', 'job_description', 'job_desig', 'job_type',
       'key_skills', 'location', 'salary', 'company_name_encoded'],
      dtype='object')

In [5]:
df.nunique()

Unnamed: 0              19802
experience                129
job_description          9059
job_desig               11708
job_type                    5
key_skills              12951
location                 1504
salary                      6
company_name_encoded     5035
dtype: int64

In [6]:
df['job_type'].unique()

array([nan, 'Analytics', 'analytics', 'Analytic', 'ANALYTICS', 'analytic'],
      dtype=object)

In [7]:
df['salary'].unique()

array(['6to10', '10to15', '15to25', '3to6', '25to50', '0to3'],
      dtype=object)

# Descriptive Statistics

In [8]:
df.describe()

         Unnamed: 0  company_name_encoded
count  19802.000000          19802.000000
mean    9900.500000           2379.723866
std     5716.489351           1475.342341
min        0.000000              0.000000
25%     4950.250000           1067.000000
50%     9900.500000           2225.000000
75%    14850.750000           3621.000000
max    19801.000000           5034.000000

In [9]:
data1=df.drop(['Unnamed: 0','job_description','job_type','key_skills'], axis = 1)

# DATA PREPROCESSING

In [10]:
data1.head()

,experience,job_desig,location,salary,company_name_encoded
0,5-7 yrs,Senior Exploit and Vulnerability Researcher,Delhi NCR(Vikas Puri),6to10,3687
1,10-17 yrs,Head SCM,Sonepat,10to15,458
2,5-9 yrs,Deputy Manager - Talent Management & Leadershi...,Delhi NCR,15to25,4195
3,7-10 yrs,Associate Manager Data Engineering,Bengaluru,10to15,313
4,1-3 yrs,TS- GSA- Senior Analyst,Gurgaon,3to6,1305

In [11]:
data1.isna().sum()

experience              0
job_desig               0
location                0
salary                  0
company_name_encoded    0
dtype: int64

There is no missing value present in the dataset

# Feature Reduction

In [12]:
data1.drop(['job_desig'],axis=1,inplace=True)

# Splitting of train data into feature and target columns

In [13]:
X=data1.drop(['salary'],axis=1)
X.head()

  experience               location  company_name_encoded
0    5-7 yrs  Delhi NCR(Vikas Puri)                  3687
1  10-17 yrs                Sonepat                   458
2    5-9 yrs              Delhi NCR                  4195
3   7-10 yrs              Bengaluru                   313
4    1-3 yrs                Gurgaon                  1305

In [15]:
y=data1['salary']

# Encoding of train dataset

In [ ]:
X.columns

# One Hot Encoding

In [16]:
X.dtypes

experience              object
location                object
company_name_encoded     int64
dtype: object